"""
Напишите программу, которая выводит факториал введенного числа.
Код нахождения факториала должен быть написан в одну строк.
"""


from math import factorial


if __name__ == '__main__':
    print(factorial(4))
