'''
Напишите программу, которая с помощью анонимной функции
извлеките из списка числа, делимые на 15. Результат вывести на
экран.

'''

def calculation(x, y):
    return f'Результат сложения: {x + y}. Результат вычитания: {x - y}.'
    
print(calculation(7, 3))
